# customer-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-cockroachdb-serverless-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database.cockroach_database.default will be created
  + resource "cockroach_database" "default" {
      + cluster_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "staging-customer"
      + table_count = (known after apply)
    }

  # module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "cluster_id" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "staging-cockroachdb-serverless-cluster-id"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-customer-database-migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "staging-customer-database-migration"
      + password   = (sensitive value)
    }

  # module.common_resources.module.database_migration_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + keepers          = {
          + "random_seed" = "1b2668d9-a318-4154-a87e-d2669d514177"
        }
      + length           = 64
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*